# InsulationTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationTypeSet Class
Members See Also
---
A set that contains insulation types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InsulationTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class InsulationTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class InsulationTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..InsulationTypeSet
# See Also
InsulationTypeSet Members
Autodesk.Revit.DB.Electrical Namespace